ayEnvira/EnviMote/module/boards.txt
# Copyright (c) 2015 Atmel Corp./Thibaut VIARD. All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.CPUFreq=CPU Frequency
menu.BootloaderLD=Bootloader

#--------------------------------------------------------------------------------------#
envimote.name=enviMote
envimote.vid.0=0x03eb
envimote.pid.0=0x6124
envimote.vid.1=0x2341
envimote.pid.1=0x004d
envimote.upload.tool=arduino:bossac
envimote.upload.protocol=sam-ba
envimote.upload.maximum_size=262144
envimote.upload.use_1200bps_touch=true
envimote.upload.wait_for_upload_port=true
envimote.upload.native_usb=false
envimote.build.mcu=cortex-m0plus
envimote.build.f_cpu=8000000L
envimote.build.usb_product="Atmel SAMD21-XPRO"
envimote.build.usb_manufacturer="Atmel Corp"
envimote.build.board=ENVIRA_Mote
envimote.build.core=arduino:arduino
envimote.build.extra_flags=-D__SAMD21J18A__
envimote.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
envimote.build.openocdscript=
envimote.build.variant=envimote_board_v4
envimote.build.variant_system_lib=
envimote.build.vid=0x2341
envimote.build.pid=0x804d

envimote.menu.CPUFreq.48=48MHz
envimote.menu.CPUFreq.48.build.f_cpu=48000000L
envimote.menu.CPUFreq.24=24MHz
envimote.menu.CPUFreq.24.build.f_cpu=24000000L
envimote.menu.CPUFreq.16=16MHz
envimote.menu.CPUFreq.16.build.f_cpu=16000000L
envimote.menu.CPUFreq.8=8MHz
envimote.menu.CPUFreq.8.build.f_cpu=8000000L

envimote.menu.BootloaderLD.YES=Width Bootloader
envimote.menu.BootloaderLD.YES.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
envimote.menu.BootloaderLD.NO=Widthout Bootloader
envimote.menu.BootloaderLD.NO.build.ldscript=linker_scripts/gcc/flash_without_bootloader.ld

#--------------------------------------------------------------------------------------#
